Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dma.c
/**
 ******************************************************************************
 * @file    bl702_dma.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_dma.h"
#include "bl702.h"
#include "bl702_glb.h"
#include "string.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DMA
 *  @{
 */

/** @defgroup  DMA_Private_Macros
 *  @{
 */
#define DMA_CHANNEL_OFFSET  0x100
#define DMA_Get_Channel(ch) (DMA_BASE + DMA_CHANNEL_OFFSET + (ch) * 0x100)
static intCallback_Type *dmaIntCbfArra[DMA_CH_MAX][DMA_INT_ALL] = {{NULL, NULL}, {NULL, NULL}, {NULL, NULL}, {NULL, NULL}};
static DMA_LLI_Ctrl_Type PingPongListArra[DMA_CH_MAX][2];

/*@} end of group DMA_Private_Macros */

/** @defgroup  DMA_Private_Types
 *  @{
 */

/*@} end of group DMA_Private_Types */

/** @defgroup  DMA_Private_Variables
 *  @{
 */

/*@} end of group DMA_Private_Variables */

/** @defgroup  DMA_Global_Variables
 *  @{
 */

/*@} end of group DMA_Global_Variables */

/** @defgroup  DMA_Private_Fun_Declaration
 *  @{
 */

/*@} end of group DMA_Private_Fun_Declaration */

/** @defgroup  DMA_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  DMA interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DMA_ALL_IRQHandler(void) {
  uint32_t tmpVal;
  uint32_t intClr;
  uint8_t  ch;
  /* Get DMA register */
  uint32_t DMAChs = DMA_BASE;

  for (ch = 0; ch < DMA_CH_MAX; ch++) {
    tmpVal = BL_RD_REG(DMAChs, DMA_INTTCSTATUS);

    if ((BL_GET_REG_BITS_VAL(tmpVal, DMA_INTTCSTATUS) & (1 << ch)) != 0) {
      /* Clear interrupt */
      tmpVal = BL_RD_REG(DMAChs, DMA_INTTCCLEAR);
      intClr = BL_GET_REG_BITS_VAL(tmpVal, DMA_INTTCCLEAR);
      intClr |= (1 << ch);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_INTTCCLEAR, intClr);
      BL_WR_REG(DMAChs, DMA_INTTCCLEAR, tmpVal);

      if (dmaIntCbfArra[ch][DMA_INT_TCOMPLETED] != NULL) {
        /* Call the callback function */
        dmaIntCbfArra[ch][DMA_INT_TCOMPLETED]();
      }
    }
  }

  for (ch = 0; ch < DMA_CH_MAX; ch++) {
    tmpVal = BL_RD_REG(DMAChs, DMA_INTERRORSTATUS);

    if ((BL_GET_REG_BITS_VAL(tmpVal, DMA_INTERRORSTATUS) & (1 << ch)) != 0) {
      /*Clear interrupt */
      tmpVal = BL_RD_REG(DMAChs, DMA_INTERRCLR);
      intClr = BL_GET_REG_BITS_VAL(tmpVal, DMA_INTERRCLR);
      intClr |= (1 << ch);
      tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_INTERRCLR, intClr);
      BL_WR_REG(DMAChs, DMA_INTERRCLR, tmpVal);

      if (dmaIntCbfArra[ch][DMA_INT_ERR] != NULL) {
        /* Call the callback function */
        dmaIntCbfArra[ch][DMA_INT_ERR]();
      }
    }
  }
}
#endif

/*@} end of group DMA_Private_Functions */

/** @defgroup  DMA_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  DMA enable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Enable(void) {
  uint32_t tmpVal;
  /* Get DMA register */
  uint32_t DMAChs = DMA_BASE;

  tmpVal = BL_RD_REG(DMAChs, DMA_TOP_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, DMA_E);
  BL_WR_REG(DMAChs, DMA_TOP_CONFIG, tmpVal);
#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(DMA_ALL_IRQn, DMA_ALL_IRQHandler);
#endif
}

/****************************************************************************/ /**
                                                                                * @brief  DMA disable
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Disable(void) {
  uint32_t tmpVal;
  /* Get DMA register */
  uint32_t DMAChs = DMA_BASE;

  tmpVal = BL_RD_REG(DMAChs, DMA_TOP_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_E);
  BL_WR_REG(DMAChs, DMA_TOP_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA channel init
                                                                                *
                                                                                * @param  chCfg: DMA configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Channel_Init(DMA_Channel_Cfg_Type *chCfg) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(chCfg->ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(chCfg->ch));
  CHECK_PARAM(IS_DMA_TRANS_WIDTH_TYPE(chCfg->srcTransfWidth));
  CHECK_PARAM(IS_DMA_TRANS_WIDTH_TYPE(chCfg->dstTransfWidth));
  CHECK_PARAM(IS_DMA_BURST_SIZE_TYPE(chCfg->srcBurstSzie));
  CHECK_PARAM(IS_DMA_BURST_SIZE_TYPE(chCfg->dstBurstSzie));
  CHECK_PARAM(IS_DMA_TRANS_DIR_TYPE(chCfg->dir));
  CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(chCfg->dstPeriph));
  CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(chCfg->srcPeriph));

