Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dma.c
  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_DMA);

  /* Config channel config */
  BL_WR_REG(DMAChs, DMA_SRCADDR, chCfg->srcDmaAddr);
  BL_WR_REG(DMAChs, DMA_DSTADDR, chCfg->destDmaAddr);

  tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, chCfg->transfLength);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SWIDTH, chCfg->srcTransfWidth);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DWIDTH, chCfg->dstTransfWidth);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SBSIZE, chCfg->srcBurstSzie);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DBSIZE, chCfg->dstBurstSzie);

  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DST_ADD_MODE, chCfg->dstAddMode);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DST_MIN_MODE, chCfg->dstMinMode);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FIX_CNT, chCfg->fixCnt);

  /* FIXME: how to deal with SLargerD */
  tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_SLARGERD);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SI, chCfg->srcAddrInc);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DI, chCfg->destAddrInc);
  BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);

  tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FLOWCNTRL, chCfg->dir);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DSTPERIPHERAL, chCfg->dstPeriph);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SRCPERIPHERAL, chCfg->srcPeriph);
  BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA channel update source memory address and len
                                                                                *
                                                                                * @param  ch: DMA channel
                                                                                * @param  memAddr: source memoty address
                                                                                * @param  len: source memory data length
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Channel_Update_SrcMemcfg(uint8_t ch, uint32_t memAddr, uint32_t len) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  /* config channel config*/
  BL_WR_REG(DMAChs, DMA_SRCADDR, memAddr);
  tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, len);
  BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA channel update destination memory address and len
                                                                                *
                                                                                * @param  ch: DMA channel
                                                                                * @param  memAddr: destination memoty address
                                                                                * @param  len: destination memory data length
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Channel_Update_DstMemcfg(uint8_t ch, uint32_t memAddr, uint32_t len) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  /* config channel config*/
  BL_WR_REG(DMAChs, DMA_DSTADDR, memAddr);
  tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_TRANSFERSIZE, len);
  BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  Get DMA channel tranfersize
                                                                                *
                                                                                * @param  ch: DMA channel
                                                                                *
                                                                                * @return tranfersize size
                                                                                *
                                                                                *******************************************************************************/
uint32_t DMA_Channel_TranferSize(uint8_t ch) {
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  return BL_GET_REG_BITS_VAL(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_TRANSFERSIZE);
}

/****************************************************************************/ /**
                                                                                * @brief  Get DMA channel busy status
                                                                                *
                                                                                * @param  ch: DMA channel
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type DMA_Channel_Is_Busy(uint8_t ch) {
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  return BL_IS_REG_BIT_SET(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_E) == 1 ? SET : RESET;
}

/****************************************************************************/ /**
                                                                                * @brief  DMA enable
                                                                                *
                                                                                * @param  ch: DMA channel number
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Channel_Enable(uint8_t ch) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
  tmpVal = BL_SET_REG_BIT(tmpVal, DMA_E);
  BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA disable
                                                                                *
                                                                                * @param  ch: DMA channel number
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Channel_Disable(uint8_t ch) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
  tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_E);
  BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA init LLI transfer
                                                                                *
                                                                                * @param  ch: DMA channel number
                                                                                * @param  lliCfg: LLI configuration
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_Init(uint8_t ch, DMA_LLI_Cfg_Type *lliCfg) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));
  CHECK_PARAM(IS_DMA_TRANS_DIR_TYPE(lliCfg->dir));
  CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(lliCfg->dstPeriph));
  CHECK_PARAM(IS_DMA_PERIPH_REQ_TYPE(lliCfg->srcPeriph));

