Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dma.c
  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_DMA);

  tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_FLOWCNTRL, lliCfg->dir);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_DSTPERIPHERAL, lliCfg->dstPeriph);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DMA_SRCPERIPHERAL, lliCfg->srcPeriph);
  BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA channel update LLI
                                                                                *
                                                                                * @param  ch: DMA channel number
                                                                                * @param  LLI: LLI addr
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_Update(uint8_t ch, uint32_t LLI) {
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));

  /* Config channel config */
  // BL_WR_REG(DMAChs, DMA_LLI, LLI);
  BL702_MemCpy4((uint32_t *)DMAChs, (uint32_t *)LLI, 4);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI PingPong Structure Start
                                                                                *
                                                                                * @param  dmaPpStruct: dma pp struct pointer
                                                                                * @param  Ping_Transfer_len: ping len
                                                                                * @param  Pong_Transfer_len: pong len
                                                                                *
                                                                                * @return Succrss or not
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type DMA_LLI_PpStruct_Set_Transfer_Len(DMA_LLI_PP_Struct *dmaPpStruct, uint16_t Ping_Transfer_len, uint16_t Pong_Transfer_len) {
  struct DMA_Control_Reg dmaCtrlRegVal_temp;

  if (Ping_Transfer_len > 4096 || Pong_Transfer_len > 4096) {
    return ERROR;
  }

  dmaCtrlRegVal_temp                                         = PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl;
  dmaCtrlRegVal_temp.TransferSize                            = Ping_Transfer_len;
  PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

  dmaCtrlRegVal_temp                                         = PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl;
  dmaCtrlRegVal_temp.TransferSize                            = Pong_Transfer_len;
  PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl = dmaCtrlRegVal_temp;

  DMA_LLI_Init(dmaPpStruct->dmaChan, dmaPpStruct->DMA_LLI_Cfg);
  DMA_LLI_Update(dmaPpStruct->dmaChan, (uint32_t)&PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX]);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI Start New Transmit for Ping-Pong Buf
                                                                                *
                                                                                * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_PpBuf_Start_New_Transmit(DMA_LLI_PP_Buf *dmaPpBuf) {
  CPU_Interrupt_Disable(DMA_ALL_IRQn);

  if (dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] != NULL) {
    DMA_LLI_Update(dmaPpBuf->dmaChan, (uint32_t)dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex]);
    DMA_Channel_Enable(dmaPpBuf->dmaChan);
    dmaPpBuf->idleIndex = (dmaPpBuf->idleIndex == 0) ? 1 : 0;
  }

  CPU_Interrupt_Enable(DMA_ALL_IRQn);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI Remove Completed Ping-Pong Buf List
                                                                                *
                                                                                * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
                                                                                *
                                                                                * @return Next Ping-Pong Buf List Header
                                                                                *
                                                                                *******************************************************************************/
DMA_LLI_Ctrl_Type *DMA_LLI_PpBuf_Remove_Completed_List(DMA_LLI_PP_Buf *dmaPpBuf) {
  CPU_Interrupt_Disable(DMA_ALL_IRQn);

  dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] = NULL;
  CPU_Interrupt_Enable(DMA_ALL_IRQn);
  return dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex];
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI Append Buf to List
                                                                                *
                                                                                * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
                                                                                * @param  dmaLliList: New LLI Buf to Append
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_PpBuf_Append(DMA_LLI_PP_Buf *dmaPpBuf, DMA_LLI_Ctrl_Type *dmaLliList) {
  DMA_LLI_Ctrl_Type *pLliList = NULL;
  CPU_Interrupt_Disable(DMA_ALL_IRQn);

  pLliList = dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex];

