Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dma.c
  if (pLliList == NULL) {
    dmaLliList->nextLLI                          = 0;
    dmaLliList->dmaCtrl.I                        = 1;
    dmaPpBuf->lliListHeader[dmaPpBuf->idleIndex] = dmaLliList;
  } else {
    /*Append to last */
    while (pLliList->nextLLI != 0) {
      pLliList = (DMA_LLI_Ctrl_Type *)pLliList->nextLLI;
    }

    pLliList->nextLLI     = (uint32_t)dmaLliList;
    pLliList->dmaCtrl.I   = 0;
    dmaLliList->nextLLI   = 0;
    dmaLliList->dmaCtrl.I = 1;
  }

  if (DMA_Channel_Is_Busy(dmaPpBuf->dmaChan) == RESET) {
    /* DMA stopped: maybe stop just a few minutes ago(not enter INT due to CPU_Interrupt_Disable)
       or has already stopped before this function is called */
    if (dmaPpBuf->lliListHeader[!dmaPpBuf->idleIndex] == NULL) {
      /* DMA has already stopped before this function is called */
      DMA_LLI_PpBuf_Start_New_Transmit(dmaPpBuf);
    }
  }

  CPU_Interrupt_Enable(DMA_ALL_IRQn);
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLi Destroy Ping-Pong Buf
                                                                                *
                                                                                * @param  dmaPpBuf: DMA LLI Ping-Pong Buf
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_PpBuf_Destroy(DMA_LLI_PP_Buf *dmaPpBuf) {
  /* DMA LLI Disable */
  DMA_Channel_Disable(dmaPpBuf->dmaChan);

  if (dmaPpBuf->lliListHeader[0] != NULL && dmaPpBuf->onTransCompleted != NULL) {
    dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[0]);
  }

  dmaPpBuf->lliListHeader[0] = NULL;

  if (dmaPpBuf->lliListHeader[1] != NULL && dmaPpBuf->onTransCompleted != NULL) {
    dmaPpBuf->onTransCompleted(dmaPpBuf->lliListHeader[1]);
  }

  dmaPpBuf->lliListHeader[1] = NULL;
  dmaPpBuf->idleIndex        = 0;
}

/****************************************************************************/ /**
                                                                                * @brief  Mask/Unmask the DMA interrupt
                                                                                *
                                                                                * @param  ch: DMA channel number
                                                                                * @param  intType: Specifies the interrupt type
                                                                                * @param  intMask: Enable/Disable Specified interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_IntMask(uint8_t ch, DMA_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t DMAChs = DMA_Get_Channel(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(ch));
  CHECK_PARAM(IS_DMA_INT_TYPE(intType));

  switch (intType) {
  case DMA_INT_TCOMPLETED:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_ITC);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
      tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_I);
      BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_ITC);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
      tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONTROL), DMA_I);
      BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
    }

    break;

  case DMA_INT_ERR:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_CLR_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_IE);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_SET_REG_BIT(BL_RD_REG(DMAChs, DMA_CONFIG), DMA_IE);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
    }

    break;

  case DMA_INT_ALL:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
      tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_ITC);
      tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_IE);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
      tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
      tmpVal = BL_SET_REG_BIT(tmpVal, DMA_I);
      BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
    } else {
      /* MASK(Disable) this interrupt */
      tmpVal = BL_RD_REG(DMAChs, DMA_CONFIG);
      tmpVal = BL_SET_REG_BIT(tmpVal, DMA_ITC);
      tmpVal = BL_SET_REG_BIT(tmpVal, DMA_IE);
      BL_WR_REG(DMAChs, DMA_CONFIG, tmpVal);
      tmpVal = BL_RD_REG(DMAChs, DMA_CONTROL);
      tmpVal = BL_CLR_REG_BIT(tmpVal, DMA_I);
      BL_WR_REG(DMAChs, DMA_CONTROL, tmpVal);
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Install DMA interrupt callback function
                                                                                *
                                                                                * @param  dmaChan: DMA Channel type
                                                                                * @param  intType: DMA interrupt type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_Int_Callback_Install(DMA_Chan_Type dmaChan, DMA_INT_Type intType, intCallback_Type *cbFun) {
  /* Check the parameters */
  CHECK_PARAM(IS_DMA_CHAN_TYPE(dmaChan));
  CHECK_PARAM(IS_DMA_INT_TYPE(intType));

  dmaIntCbfArra[dmaChan][intType] = cbFun;
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI PingPong Structure Initial
                                                                                *
                                                                                * @param  dmaPpStruct: DMA LLI PingPong Config Parameter
                                                                                *
                                                                                * @return start success or not
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type DMA_LLI_PpStruct_Init(DMA_LLI_PP_Struct *dmaPpStruct) {
  // setup lliList
  dmaPpStruct->dmaCtrlRegVal.I = 1;
  dmaPpStruct->trans_index     = 0;

  if (dmaPpStruct->DMA_LLI_Cfg->dir == DMA_TRNS_M2P) {
    PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].srcDmaAddr  = dmaPpStruct->chache_buf_addr[0];
    PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;

