Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_dma.c
    PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].srcDmaAddr  = dmaPpStruct->chache_buf_addr[1];
    PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].destDmaAddr = dmaPpStruct->operatePeriphAddr;
  } else if (dmaPpStruct->DMA_LLI_Cfg->dir == DMA_TRNS_P2M) {
    PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].srcDmaAddr  = dmaPpStruct->operatePeriphAddr;
    PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].destDmaAddr = dmaPpStruct->chache_buf_addr[0];

    PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].srcDmaAddr  = dmaPpStruct->operatePeriphAddr;
    PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].destDmaAddr = dmaPpStruct->chache_buf_addr[1];
  } else {
    return ERROR;
    /*V1.0 version DMA LLI Ping-Pong structure not support P2P & M2M MODE*/
  }

  PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].nextLLI = (uint32_t)&PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX];
  PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

  PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].nextLLI = (uint32_t)&PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX];
  PingPongListArra[dmaPpStruct->dmaChan][PONG_INDEX].dmaCtrl = dmaPpStruct->dmaCtrlRegVal;

  DMA_LLI_Init(dmaPpStruct->dmaChan, dmaPpStruct->DMA_LLI_Cfg);

  DMA_LLI_Update(dmaPpStruct->dmaChan, (uint32_t)&PingPongListArra[dmaPpStruct->dmaChan][PING_INDEX]);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI PingPong Structure Start
                                                                                *
                                                                                * @param  dmaPpStruct: None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_PpStruct_Start(DMA_LLI_PP_Struct *dmaPpStruct) { DMA_Channel_Enable(dmaPpStruct->dmaChan); }

/****************************************************************************/ /**
                                                                                * @brief  DMA LLI PingPong Structure Stop
                                                                                *
                                                                                * @param  dmaPpStruct: None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void DMA_LLI_PpStruct_Stop(DMA_LLI_PP_Struct *dmaPpStruct) { DMA_Channel_Disable(dmaPpStruct->dmaChan); }

/*@} end of group DMA_Public_Functions */

/*@} end of group DMA */

/*@} end of group BL702_Peripheral_Driver */
